app/controllers/cryptobot_controller.rb

  def index
    @time = []
    @pricedelta = []
    @dataset = []

    @arg = params[:assetpair]
    @assets = Cryptobot::INTEREST

    Cryptobot.where(:assetpair => @arg).last(60).each do |h|
---
SELECT  "cryptobots".* FROM "cryptobots" WHERE "cryptobots"."assetpair" = $1 ORDER BY "cryptobots"."id" DESC LIMIT $2  [["assetpair", "USDT_BTC"], ["LIMIT", 60]]

  def show
    @price = []
    @tbats = []
    @sma = []
    @ema = []
    @arg = params[:assetpair]
    @assets = []
    @assets << Cryptobot.where(:assetpair => @arg).last[:assetpair]

    Cryptobot.where(:assetpair => @arg).each do |h|
      @price << [h[:time]*1000, h[:price].to_f]
      @sma << [h[:time]*1000, h[:sma].to_f]
      @ema << [h[:time]*1000, h[:ema].to_f]
    end

    Forecast.where(:assetpair => @arg).each do |h|
---
SELECT  "cryptobots".* FROM "cryptobots" WHERE "cryptobots"."assetpair" = $1 ORDER BY "cryptobots"."id" DESC LIMIT $2  [["assetpair", "USDT_ETH"], ["LIMIT", 1]]
SELECT "forecasts".* FROM "forecasts" WHERE "forecasts"."assetpair" = $1  [["assetpair", "USDT_ETH"]]