app/controllers/portfolio_controller.rb

	def poketvalue
    @delta = []
    Cryptobot.last(Cryptobot::INTEREST.count).each do |h|
      @delta << [h[:assetpair], h[:time], h[:pricedelta], h[:order], h[:initial_weight], h[:optim_weight], h[:amount]]
    end

    @pv = []
    @poket = []

  	Portfolio.where.not(:poket_value => nil).last(60).each do |h|
  		@pv << [h[:time]*1000, h[:poket_value].to_f]
  	end

    Portfolio.last(Cryptobot::INTEREST.count).each do |h|
---
SELECT  "cryptobots".* FROM "cryptobots" ORDER BY "cryptobots"."id" DESC LIMIT $1  [["LIMIT", 10]]
SELECT  "portfolios".* FROM "portfolios" WHERE ("portfolios"."poket_value" IS NOT NULL) ORDER BY "portfolios"."id" DESC LIMIT $1  [["LIMIT", 60]]
SELECT  "portfolios".* FROM "portfolios" ORDER BY "portfolios"."id" DESC LIMIT $1  [["LIMIT", 10]]